.sbom/pipdeptree.sbom-3.12.dot
digraph {
	"annotated-types" [label="annotated-types\n0.7.0"]
	"antlr4-python3-runtime" [label="antlr4-python3-runtime\n4.13.2"]
	"boolean-py" [label="boolean.py\n5.0"]
	"charset-normalizer" [label="charset-normalizer\n3.4.1"]
	"cyclonedx-bom" -> "cyclonedx-python-lib" [label=">=8.0,<10.0"]
	"cyclonedx-bom" -> "packageurl-python" [label=">=0.11,<2"]
	"cyclonedx-bom" -> "pip-requirements-parser" [label=">=32.0,<33.0"]
	"cyclonedx-bom" -> chardet [label=">=5.1,<6.0"]
	"cyclonedx-bom" -> packaging [label=">=22,<25"]
	"cyclonedx-bom" [label="cyclonedx-bom\n5.3.0"]
	"cyclonedx-python-lib" -> "license-expression" [label=">=30,<31"]
	"cyclonedx-python-lib" -> "packageurl-python" [label=">=0.11,<2"]
	"cyclonedx-python-lib" -> "py-serializable" [label=">=2.0.0,<3.0.0"]
	"cyclonedx-python-lib" -> sortedcontainers [label=">=2.4.0,<3.0.0"]
	"cyclonedx-python-lib" [label="cyclonedx-python-lib\n9.1.0"]
	"dagster-job-processor" -> dagster [label=any]
	"dagster-job-processor" -> gazu [label=any]
	"dagster-job-processor" [label="dagster-job-processor\n0.0.post1.dev38+gbaf3220"]
	"dagster-pipes" [label="dagster-pipes\n1.9.11"]
	"dagster-postgres" -> "psycopg2-binary" [label=any]
	"dagster-postgres" -> dagster [label="==1.9.11"]
	"dagster-postgres" [label="dagster-postgres\n0.25.11"]
	"dagster-shared" -> "dagster-pipes" [label=any]
	"dagster-shared" -> dagster [label=any]
	"dagster-shared" [label="dagster-shared\n0.0.post1.dev10+g614f3c1"]
	"dependency-groups" -> packaging [label=any]
	"dependency-groups" [label="dependency-groups\n1.3.0"]
	"docker-compose-graph" -> "python-dotenv" [label=any]
	"docker-compose-graph" -> graphviz [label=any]
	"docker-compose-graph" -> jinja2 [label=any]
	"docker-compose-graph" -> pydot [label=any]
	"docker-compose-graph" -> pyyaml [label=any]
	"docker-compose-graph" [label="docker-compose-graph\n0.0.post1.dev176+gbc4b36e"]
	"docstring-parser" [label="docstring_parser\n0.16"]
	"grpcio-health-checking" -> grpcio [label=">=1.71.0"]
	"grpcio-health-checking" -> protobuf [label=">=5.26.1,<6.0dev"]
	"grpcio-health-checking" [label="grpcio-health-checking\n1.71.0"]
	"jsonschema-specifications" -> referencing [label=">=0.31.0"]
	"jsonschema-specifications" [label="jsonschema-specifications\n2024.10.1"]
	"license-expression" -> "boolean-py" [label=">=4.0"]
	"license-expression" [label="license-expression\n30.4.1"]
	"markdown-it-py" -> mdurl [label="~=0.1"]
	"markdown-it-py" [label="markdown-it-py\n3.0.0"]
	"openstudiolandscapes-dagster" -> "python-on-whales" [label=any]
	"openstudiolandscapes-dagster" -> dagster [label="==1.9.11"]
	"openstudiolandscapes-dagster" -> openstudiolandscapes [label=any]
	"openstudiolandscapes-dagster" -> pyyaml [label=any]
	"openstudiolandscapes-dagster" [label="OpenStudioLandscapes-Dagster\n0.0.post1.dev61+ga1a50ba.d20250407"]
	"packageurl-python" [label="packageurl-python\n0.16.0"]
	"pip-requirements-parser" -> packaging [label=any]
	"pip-requirements-parser" -> pyparsing [label=any]
	"pip-requirements-parser" [label="pip-requirements-parser\n32.0.1"]
	"psycopg2-binary" [label="psycopg2-binary\n2.9.10"]
	"py-serializable" -> defusedxml [label=">=0.7.1,<0.8.0"]
	"py-serializable" [label="py-serializable\n2.0.0"]
	"pydantic-core" -> "typing-extensions" [label=">=4.6.0,!=4.7.0"]
	"pydantic-core" [label="pydantic_core\n2.33.1"]
	"python-dateutil" -> six [label=">=1.5"]
	"python-dateutil" [label="python-dateutil\n2.9.0.post0"]
	"python-dotenv" [label="python-dotenv\n1.1.0"]
	"python-engineio" -> "simple-websocket" [label=">=0.10.0"]
	"python-engineio" [label="python-engineio\n4.11.2"]
	"python-on-whales" -> "typing-extensions" [label=any]
	"python-on-whales" -> pydantic [label=">=2,<3,!=2.0.*"]
	"python-on-whales" [label="python-on-whales\n0.76.1"]
	"python-socketio" -> "python-engineio" [label=">=4.11.0"]
	"python-socketio" -> bidict [label=">=0.21.0"]
	"python-socketio" [label="python-socketio\n5.12.1"]
	"rfc3339-validator" -> six [label=any]
	"rfc3339-validator" [label="rfc3339-validator\n0.1.4"]
	"rpds-py" [label="rpds-py\n0.24.0"]
	"setuptools-scm" -> packaging [label=">=20"]
	"setuptools-scm" -> setuptools [label=">=61"]
	"setuptools-scm" [label="setuptools-scm\n8.2.0"]
	"simple-websocket" -> wsproto [label=any]
	"simple-websocket" [label="simple-websocket\n1.1.0"]
	"types-python-dateutil" [label="types-python-dateutil\n2.9.0.20241206"]
	"typing-extensions" [label="typing_extensions\n4.13.1"]
	"typing-inspection" -> "typing-extensions" [label=">=4.12.0"]
	"typing-inspection" [label="typing-inspection\n0.4.0"]
	"universal-pathlib" -> fsspec [label=">=2022.1.0,!=2024.3.1"]
	"universal-pathlib" [label="universal_pathlib\n0.2.6"]
	"uri-template" [label="uri-template\n1.3.0"]
	"websocket-client" [label="websocket-client\n1.8.0"]
	alembic -> "typing-extensions" [label=">=4.12"]
	alembic -> mako [label=any]
	alembic -> sqlalchemy [label=">=1.4.0"]
	alembic [label="alembic\n1.15.2"]
	argcomplete [label="argcomplete\n3.6.2"]
	arrow -> "python-dateutil" [label=">=2.7.0"]
	arrow -> "types-python-dateutil" [label=">=2.8.10"]
	arrow [label="arrow\n1.3.0"]
	attrs [label="attrs\n25.3.0"]
	bidict [label="bidict\n0.23.1"]
	certifi [label="certifi\n2025.1.31"]
	chardet [label="chardet\n5.2.0"]
	click [label="click\n8.1.8"]
	coloredlogs -> humanfriendly [label=">=7.1"]
	coloredlogs [label="coloredlogs\n14.0"]
	colorlog [label="colorlog\n6.9.0"]
	configupdater [label="ConfigUpdater\n3.2"]
	dagster -> "antlr4-python3-runtime" [label=any]
	dagster -> "dagster-pipes" [label="==1.9.11"]
	dagster -> "docstring-parser" [label=any]
	dagster -> "grpcio-health-checking" [label=">=1.44.0"]
	dagster -> "python-dotenv" [label=any]
	dagster -> "typing-extensions" [label=">=4.10.0,<5"]
	dagster -> "universal-pathlib" [label=">=0.2.0"]
	dagster -> alembic [label=">=1.2.1,!=1.7.0,!=1.6.3,!=1.11.0"]
	dagster -> click [label=">=5.0"]
	dagster -> coloredlogs [label=">=6.1,<=14.0"]
	dagster -> filelock [label=any]
	dagster -> grpcio [label=">=1.44.0"]
	dagster -> jinja2 [label=any]
	dagster -> packaging [label=">=20.9"]
	dagster -> protobuf [label=">=4,<6"]
	dagster -> pydantic [label=">=2,<3.0.0"]
	dagster -> pytz [label=any]
	dagster -> pyyaml [label=">=5.1"]
	dagster -> requests [label=any]
	dagster -> rich [label=any]
	dagster -> setuptools [label=any]
	dagster -> six [label=any]
	dagster -> sqlalchemy [label=">=1.0,<3"]
	dagster -> structlog [label=any]
	dagster -> tabulate [label=any]
	dagster -> tomli [label="<3"]
	dagster -> toposort [label=">=1.0"]
	dagster -> tqdm [label="<5"]
	dagster -> watchdog [label=">=0.8.3,<6"]
	dagster [label="dagster\n1.9.11"]
	defusedxml [label="defusedxml\n0.7.1"]
	deprecated -> wrapt [label=">=1.10,<2"]
	deprecated [label="Deprecated\n1.2.18"]
	distlib [label="distlib\n0.3.9"]
	docker -> requests [label=">=2.26.0"]
	docker -> urllib3 [label=">=1.26.0"]
	docker [label="docker\n7.1.0"]
	filelock [label="filelock\n3.18.0"]
	fqdn [label="fqdn\n1.5.1"]
	fsspec [label="fsspec\n2025.3.2"]
	gazu -> "python-socketio" [label=">=5.11.0,<6"]
	gazu -> deprecated [label="==1.2.18"]
	gazu -> requests [label=">=2.25.1"]
	gazu [label="gazu\n0.10.31"]
	gitdb -> smmap [label=">=3.0.1,<6"]
	gitdb [label="gitdb\n4.0.12"]
	gitpython -> gitdb [label=">=4.0.1,<5"]
	gitpython [label="GitPython\n3.1.44"]
	graphviz [label="graphviz\n0.20.3"]
	greenlet [label="greenlet\n3.1.1"]
	grpcio [label="grpcio\n1.71.0"]
	h11 [label="h11\n0.14.0"]
	humanfriendly [label="humanfriendly\n10.0"]
	idna [label="idna\n3.10"]
	isoduration -> arrow [label=">=0.15.0"]
	isoduration [label="isoduration\n20.11.0"]
	jinja2 -> markupsafe [label=">=2.0"]
	jinja2 [label="Jinja2\n3.1.6"]
	jsonpointer [label="jsonpointer\n3.0.0"]
	jsonschema -> "jsonschema-specifications" [label=">=2023.03.6"]
	jsonschema -> "rpds-py" [label=">=0.7.1"]
	jsonschema -> attrs [label=">=22.2.0"]
	jsonschema -> referencing [label=">=0.28.4"]
	jsonschema [label="jsonschema\n4.23.0"]
	lxml [label="lxml\n5.3.2"]
	mako -> markupsafe [label=">=0.9.2"]
	mako [label="Mako\n1.3.9"]
	markupsafe [label="MarkupSafe\n3.0.2"]
	mdurl [label="mdurl\n0.1.2"]
	nox -> "dependency-groups" [label=">=1.1"]
	nox -> argcomplete [label=">=1.9.4,<4"]
	nox -> attrs [label=">=23.1"]
	nox -> colorlog [label=">=2.6.1,<7"]
	nox -> packaging [label=">=20.9"]
	nox -> virtualenv [label=">=20.14.1"]
	nox [label="nox\n2025.2.9"]
	openstudiolandscapes -> "dagster-job-processor" [label=any]
	openstudiolandscapes -> "dagster-postgres" [label=any]
	openstudiolandscapes -> "dagster-shared" [label=any]
	openstudiolandscapes -> "docker-compose-graph" [label=any]
	openstudiolandscapes -> "python-on-whales" [label=any]
	openstudiolandscapes -> dagster [label="==1.9.11"]
	openstudiolandscapes -> docker [label=any]
	openstudiolandscapes -> gitpython [label=any]
	openstudiolandscapes -> nox [label=any]
	openstudiolandscapes -> pydot [label=any]
	openstudiolandscapes -> pyscaffold [label=any]
	openstudiolandscapes -> pyyaml [label=any]
	openstudiolandscapes [label="OpenStudioLandscapes\n0.0.post1.dev572+g0f1f924"]
	packaging [label="packaging\n24.2"]
	pip [label="pip\n25.0.1"]
	pipdeptree -> packaging [label=">=24.1"]
	pipdeptree -> pip [label=">=24.2"]
	pipdeptree [label="pipdeptree\n2.26.0"]
	platformdirs [label="platformdirs\n4.3.7"]
	protobuf [label="protobuf\n5.29.4"]
	pydantic -> "annotated-types" [label=">=0.6.0"]
	pydantic -> "pydantic-core" [label="==2.33.1"]
	pydantic -> "typing-extensions" [label=">=4.12.2"]
	pydantic -> "typing-inspection" [label=">=0.4.0"]
	pydantic [label="pydantic\n2.11.2"]
	pydot -> pyparsing [label=">=3.0.9"]
	pydot [label="pydot\n3.0.4"]
	pygments [label="Pygments\n2.19.1"]
	pyparsing [label="pyparsing\n3.2.3"]
	pyscaffold -> "setuptools-scm" [label=">=5"]
	pyscaffold -> configupdater [label=">=3.0,<4"]
	pyscaffold -> packaging [label=">=20.7"]
	pyscaffold -> platformdirs [label=">=2"]
	pyscaffold -> setuptools [label=">=46.1.0"]
	pyscaffold -> tomlkit [label=">=0.7.0,<2"]
	pyscaffold [label="PyScaffold\n4.6"]
	pytz [label="pytz\n2025.2"]
	pyyaml [label="PyYAML\n6.0.2"]
	referencing -> "rpds-py" [label=">=0.7.0"]
	referencing -> "typing-extensions" [label=">=4.4.0"]
	referencing -> attrs [label=">=22.2.0"]
	referencing [label="referencing\n0.36.2"]
	requests -> "charset-normalizer" [label=">=2,<4"]
	requests -> certifi [label=">=2017.4.17"]
	requests -> idna [label=">=2.5,<4"]
	requests -> urllib3 [label=">=1.21.1,<3"]
	requests [label="requests\n2.32.3"]
	rfc3987 [label="rfc3987\n1.3.8"]
	rich -> "markdown-it-py" [label=">=2.2.0"]
	rich -> pygments [label=">=2.13.0,<3.0.0"]
	rich [label="rich\n14.0.0"]
	setuptools [label="setuptools\n78.1.0"]
	six [label="six\n1.17.0"]
	smmap [label="smmap\n5.0.2"]
	sortedcontainers [label="sortedcontainers\n2.4.0"]
	sqlalchemy -> "typing-extensions" [label=">=4.6.0"]
	sqlalchemy -> greenlet [label=">=1"]
	sqlalchemy [label="SQLAlchemy\n2.0.40"]
	structlog [label="structlog\n25.2.0"]
	tabulate [label="tabulate\n0.9.0"]
	tomli [label="tomli\n2.2.1"]
	tomlkit [label="tomlkit\n0.13.2"]
	toposort [label="toposort\n1.10"]
	tqdm [label="tqdm\n4.67.1"]
	urllib3 [label="urllib3\n2.3.0"]
	virtualenv -> distlib [label=">=0.3.7,<1"]
	virtualenv -> filelock [label=">=3.12.2,<4"]
	virtualenv -> platformdirs [label=">=3.9.1,<5"]
	virtualenv [label="virtualenv\n20.30.0"]
	watchdog [label="watchdog\n5.0.3"]
	webcolors [label="webcolors\n24.11.1"]
	wrapt [label="wrapt\n1.17.2"]
	wsproto -> h11 [label=">=0.9.0,<1"]
	wsproto [label="wsproto\n1.2.0"]
}
